import { ref, computed } from 'vue'
import { defineStore } from 'pinia'

export const useBlogStore = defineStore('blog', () => {
  const blogsData = ref([
    {
      id: 1,
      title: 'سلام دنیا',
      slug: 'سلام-دنیا',
      description:
        'خیلی وقت بود که دوست داشتم وبلاگ خودم رو داشته باشم. یکی دوبار هم تلاش کردم ولی ادامه ندادم. دوست داشتم جایی باشه تا نظرات خودم رو بنویسم و یا شاید هم چند تا پست برای آموزش برنامه‌نویسی نوشتم.',
      body: '<p>خیلی وقت بود که دوست داشتم وبلاگ خودم رو داشته باشم. یکی دوبار هم تلاش کردم ولی ادامه ندادم. دوست داشتم جایی باشه تا نظرات خودم رو بنویسم و یا شاید هم چند تا پست برای آموزش برنامه‌نویسی نوشتم.</p> <p>اما دلیل اصلی که تو این زمان شروع کردم به ساخت وبلاگ اینه که حس می‌کنم دارم بزرگ می‌شم، نه از اون نظر که دانایی بسیاری کسب کردم و الان وقتشه که انتشارشون بدم. نه.فکر می‌کنم حافظه‌ام پر شده و هر خاطره جدید که می‌آد یه خاطره قدیمی رو پاک می‌کنه. شاید مسخره باشه ولی الان حس می‌کنم آدم خنگ‌تری هستم نسبت به چند سال قبل خودم. که البته اصلا منطقی نیست چون اندوخته‌های این چند مدت به علاوه اندوخته‌های قبلی‌ام باید باعث پیشرفت بشه نه نقطه‌ای که الان هستم. بیخیال بیاین از اینا عبور کنیم.</p> <p>این پروژه وبلاگ با Vuejs درست شده و بخش زیادی از طرح بصری (همون دیزاین خودمون) از بلاگ گیت‌هاب کپی شده. فعلا هیچ بخش خاصی نداره که بخوام توضیح بدم، پس یکم در مورد تعریف خودم از وبلاگ صحبت می‌کنم.</p> <p>زمانی که من برای اولین بار به اینترنت دسترسی پیدا کردم، سال اول راهنماییم بود (الان شده متوسطه اول). اون موقع ما با فیلتر شکن‌ها و روش‌های پیچیده‌ای که این روز ها با استفاده ازشون به اینترنت وصل می‌شیم آشنا نبودم. قهرمان اون زمان من موتورهای جستجویی مثل یاهو، گوگل و بینگ بودن که البته گوگل از بقیه بهتر بود. رفته رفته یاد گرفتم که چطور از چیزی که اون زمان بهش می‌گفتیم اینترنت استفاده کنم. سرچ می‌کردیم و توی سایت‌هایی که میاورد جوابم رو پیدا می‌کردیم و یا انقدر خوش شانس بودم که ساعت رولکس چند میلیون تومنی اون زمان رو سی و نه هزار تومن برنده می‌شدیم. تمام درک من هم از شبکه اجتماعی انجمن های فارسی زبانی بود که توشون عضو بودم.</p> <p>شاید بشه اون زمان رو روزهای آخر دوران باشکوه وبلاگ نویسی بیان کرد. و همچنین روزهای شروع جنگ کمپانی‌ها، که کدوم سریع تر گوشی با صفحه نمایش بزرگتر و تعداد هسته سی‌پی‌یو بیشتر به بازار می‌دن. زمانی که دید انتقادی به ماهیت تکنولوژی های جدید هیچ جایگاهی بین ما نداشت.</p> <p>در این لحظه ساخت این بلاگ شاید ایده خوبی باشه، تا ببینیم چی پیش میاد :)</p> ',
      author: 'مصطفی نعمت‌پور',
      imageURL: '/public/image/hello-word-image.png',
      imageAlt: 'متن hello world که روی یک تصویر با زمینه تیره نوشته شده',
      blogColor: '#0C111C',
      categories: [
        {
          id: 1,
          title: 'عمومی',
          color: ['#42d392', '#647eff']
        }
      ]
    }
  ])
  function getBlog(id: Number) {
    return blogsData.value.find((item) => item.id === id)
  }

  return { blogsData, getBlog }
})
