import type { Post } from '@/types/post'
import type { Category } from '@/types/category'
import { categories } from '@/data/categories-data'

const posts: Post[] = [
  {
    id: 5,
    title: 'Gravatar یک پروفایل برای همه چیز، همه جا.',
    slug: 'قاصدک',
    description:
      'قاصدک! هان، چه خبر آوردی؟ از کجا، وَز کِه خبر آوردی؟ خوش خبر باشی، امّا، امّا گِرد بام و دَرِ من بی ثَمَر می‌گردی. انتظار خبری نیست مرا نه زِ یاری نه زِ دَیّار و دیاری - باری، برو آنجا که بُوَد چشمی و گوشی با کس، برو آنجا که تو را منتظرند.',
    body: '<h3 id="hi">hi</h3> <p>سایت <a href="https://gravatar.com/">gravatar.com</a> امکان جالبی رو فراهم کرده</p> <p>سایت <a href="https://gravatar.com/">gravatar.com</a> یک پلتفرم بسیار مفید برای مدیریت تصویر پروفایل هست. این سرویس به کاربران این امکان رو می‌ده تا یک تصویر پروفایل را برای خود ایجاد کنند و از اون در سایت‌ها، وبلاگ‌ها، ایمیل‌ها و سایر پلتفرم‌های آنلاین خودشون استفاده کنند.</p> <p>استفاده از Gravatar بسیار ساده است. بعد از ثبت‌نام در سایت، کاربران می‌توانند تصویر پروفایل خود را آپلود کرده و آن را با آدرس ایمیل خود مرتبط کنند. سپس، در هر جا که از این ایمیل استفاده شود و سرویس Gravatar فعال باشد، تصویر پروفایل متناسب با آن آدرس ایمیل نمایش داده خواهد شد.</p> <p>با استفاده از Gravatar، کاربران می‌توانند به راحتی هویت خود را در طول زمان در اینترنت حفظ کنند و از یک تصویر پروفایل یکتا برای برقراری ارتباط با دیگران استفاده کنند.</p>',
    author: 'مصطفی نعمت‌پور',
    imageURL: '/image/post/5-gravatar/cover.jpg',
    imageAlt: null,
    blogColor: '#1f2328',
    categories: getCategories([6]),
    createAt: '2024-05-09 15:30',
    updateAt: '2024-05-09 15:30'
  },
  {
    id: 4,
    title: 'شعر قاصدک هان، چه خبر آوردی؟',
    slug: 'قاصدک',
    description:
      'قاصدک! هان، چه خبر آوردی؟ از کجا، وَز کِه خبر آوردی؟ خوش خبر باشی، امّا، امّا گِرد بام و دَرِ من بی ثَمَر می‌گردی. انتظار خبری نیست مرا نه زِ یاری نه زِ دَیّار و دیاری - باری، برو آنجا که بُوَد چشمی و گوشی با کس، برو آنجا که تو را منتظرند.',
    body: '<p>قاصدک! هان، چه خبر آوردی؟</p> <p>از کجا، وَز کِه خبر آوردی؟</p> <p>خوش خبر باشی، امّا، امّا</p> <p>گِرد بام و دَرِ من</p> <p>بی ثَمَر می‌گردی.</p> <p>انتظارِ خبری نیست مرا</p> <p>نه زِ یاری نه زِ دَیّار و دیاری - باری،</p> <p>برو آنجا که بُوَد چشمی و گوشی با کس،</p> <p>برو آنجا که تو را منتظرند.</p> <p>قاصدک!</p> <p>در دلِ من همه کورند و کَرَند.</p> <p>دست بَردار از این در وطنِ خویش غریب.</p> <p>قاصدِ تجربه‌هایِ همه تلخ،</p> <p>با دلم می‌گوید</p> <p>که دروغی تو، دروغ؛</p> <p>که فریبی تو، فریب.</p> <p>قاصدک! هان، ولی… آخر… ای وای!</p> <p>راستی آیا رفتی با باد؟</p> <p>با تواَم، آی! کجا رفتی؟ آی…!</p> <p>راستی آیا جایی خبری هست هنوز؟</p> <p>مانده خاکسترِ گرمی، جایی؟</p> <p>در اجاقی- طَمَعِ شعله نمی‌بندم- خُردَک شَرَری هست هنوز؟</p> <p>قاصدک!</p> <p>ابرهایِ همه عالم شب و روز</p> <p>در دلم می‌گریند.</p> <p>تهران شهریور  ۱۳۳۸</p> <h2 id="">معنی شعر قاصدک</h2> <p>قاصدک چه خبری را برای من آوردی؟ از کجا می‌آیی و از چه کسی خبر آوردی؟ خوش خبر باشی ولی دور و بَرِ من بیهوده می‌چرخی.</p> <p>نه از دوستی و نه از هیچکسِ دیگری انتظار رسیدن خبری را ندارم. قاصدک برو جایی که چشم آدم‌ها می‌بیند و گوششان می‌شنود. گوش و چشمِ دلِ من کر و کور شده است.</p> <p>دست از سرِ من که در سرزمین و خانه خودم هم غریبه و بیگانه ام، بردار.</p> <p>پیغام آور خاطره‌های سخت و ناگوار، با خودم می‌گویم، اینکه تو خوش خبر هستی دروغ است. خبرهای تو، فریب و نیرنگ است.</p> <p>قاصدک! بالاخره آیا با باد رفتی؟ با تو هستم. کجا رفتی؟ راستی آیا جایی خبری هم هست؟ آیا امید و گرمی و شور زندگی برای کسی مانده است؟ طمع نور و روشنایی و گرمی آتش را ندارم. آیا بارقۀ امیدی هنوز وجود دارد؟</p> <p>قاصدک! دلم گرفته و انگار از درون گریه می‌کنم و همه غصه های عالم در دلم جمع شده است.</p> <p>منبع: <a href="https://www.sokhanvaran.org/%D8%AF%DA%A9%D9%84%D9%85%D9%87-%D8%B4%D8%B9%D8%B1-%D9%82%D8%A7%D8%B5%D8%AF%DA%A9-%D8%A8%D8%A7-%D8%B5%D8%AF%D8%A7%DB%8C-%D8%AF%DA%A9%D8%AA%D8%B1-%D9%85%D8%AD%D9%85%D8%AF-%D8%B9%D9%84%DB%8C-%D8%AD%D8%B3/">sokhanvaran.org</a></p>',
    author: 'مصطفی نعمت‌پور',
    imageURL: null,
    imageAlt: null,
    blogColor: '#1f2328',
    categories: getCategories([70, 50]),
    createAt: '2024-05-09 15:30',
    updateAt: '2024-05-09 15:30'
  },
  {
    id: 3,
    title: 'SSH به موبایل اندرویدی (Termux) بدون نیاز به پسورد',
    slug: 'termux_ssh_setup_guide',
    description:
      'در این پست سعی می‌کنیم به گوشی اندرویدی خودمون SSH بزنیم. در SSH ما یک کلاینت و یک سرور داریم. در اینجا، تلفن (Termux) به عنوان سرور عمل می‌کنه. کلاینت می‌تونه هر سیستم کامپیوتری دیگری باشه. تو این پست من با لپ تاپ لینوکسی‌ام تستش کردم.',
    body: '<p>در این پست سعی می‌کنیم به گوشی اندرویدی خودمون SSH بزنیم. در SSH ما یک کلاینت و یک سرور داریم. در اینجا، تلفن (Termux) به عنوان سرور عمل می‌کنه. کلاینت می‌تونه هر سیستم کامپیوتری دیگری باشه. تو این پست من با لپ تاپ لینوکسی‌ام تستش کردم.</p> <h2 id="termux">مرحله اول: نصب Termux</h2> <p>من Termux رو از <a href="https://f-droid.org/en/packages/com.termux/">F-Droid</a> نصب کردم. طبق گفته Termux، نسخه موجود در Google Play دیگه پشتیبانی نمی‌شه و به‌روزرسانی‌ها رو دریافت نمی‌کنه.</p> <h2 id="">مرحله دوم: ایجاد کلید</h2> <p>برای شروع فرآیند تولید کلید، دستور <code>ssh-keygen</code> را روی سیستم خود (کلاینت) اجرا کنید.</p> <pre><code class="bash language-bash">ssh-keygen -t rsa </code></pre> <p>در هر مرحله Enter رو فشار بدید تا مراحل ساخت کلید انجام بشه و همچنین نیازی به تعیین رمز عبور برای کلید نیست.</p> <p>اگر گفت فایل از قبل وجود داره، می‌تونید از کلید موجود خودتون استفاده کنید یا اون رو با یک کلید جدید جایگزین کنید.</p> <p>حالا باید دو فایل <code>id_rsa</code> و <code>id_rsa.pub</code> در دایرکتوری <code>‎~/.ssh</code> داشته باشید. <code>id_rsa</code> کلید خصوصی شما و <code>id_rsa.pub</code> کلید عمومی شما است.</p> <p>اگر از سیستم عامل ویندوز استفاده می‌کنید، <a href="https://www.purdue.edu/science/scienceit/ssh-keys-windows.html">این لینک</a> می‌تونه مفید باشه.</p> <h2 id="-1">مرحله سوم: انتقال کلید از کلاینت به سرور (موبایل)</h2> <p>روش‌های مختلفی برای انتقال کلید عمومی وجود داره. اینجا ترجیح من انتقال دستی کلید عمومی است.</p> <p>کلید عمومی شما در مسیر <code>‎~/.ssh/id_rsa.pub</code> قرار داره. با دستور زیر می‌تونید اون رو مشاهده کنید:</p> <pre><code class="bash language-bash">cat ~/.ssh/id_rsa.pub </code></pre> <p><img src="/image/post/post-termux-ssh-setup-guide/cat-pub-key.jpg" alt="تصویری از محیط ترمینال که در آن از دستور cat برای دیدن کلید عمومی استفاده کردیم" /></p> <p>می‌تونید متن رو از طریق save message در شبکه‌های اجتماعی مثل تلگرام یا از طریق پیش‌نویس ایمیل (از اونجایی که یک کلید عمومی هستش، اشتراک‌گذاریش مشکل امنیتی ایجاد نمی‌کنه) انتقال بدید.</p> <h2 id="opensshtermux">مرحله چهارم: نصب OpenSSH را روی Termux</h2> <p>از دستورات زیر استفاده کنید:</p> <pre><code>pkg upgrade<br>pkg install openssh<br></code></pre> <h2 id="termux-1">مرحله پنجم: کلید عمومی رو با Termux اضافه کنید</h2> <p>کلید عمومی که در مرحله سوم انتقالش دادید به گوشی رو در کلیپ بورد خودتون کپی کنید.</p> <p>از دستور زیر برای اضافه کردن کلید به <code>authorized_keys</code> با استفاده از ویرایشگر متن nano استفاده کنید:</p> <pre><code class="bash language-bash">nano ~/.ssh/authorized_keys </code></pre> <p>روی صفحه نگه دارید، کلید رو past کنید و با فشار دادن <code>Ctrl + S</code> و <code>Ctrl + X</code> به ترتیب فایل رو ذخیره کنید و از nano خارج بشید.</p> <p>اگر مراحل رو به درستی دنبال کرده باشید، دستور <code>cat ~/.ssh/authorized_keys</code> در Termux باید کلید رو بهتون نمایش بده.</p> <p><img src="/image/post/post-termux-ssh-setup-guide/copy-key-screenshot.jpg" alt="چند عدد اسکرین شات از نرم افزار termux که مراحل جا گذاری کلید عمومی را نشان می دهد" /></p> <h2 id="sshtermuxipname">مرحله ششم: سرور SSH را با Termux اجرا کنید و IP و Name را دریافت کنید</h2> <p>می‌تونید سرور SSH را با دستور زیر اجرا کنید:</p> <pre><code class="bash language-bash">sshd </code></pre> <p>برای پیدا کردن IP خود از دستور <code>ifconfig</code> و برای یافتن نام خود از دستور <code>whoami</code> استفاده کنید.</p> <p>برای من آی‌پی <code>192.168.1.2</code> و اسمش <code>u0_a202</code> هست.</p> <h2 id="ssh">مرحله هفتم: اتصال SSH از سمت کلاینت</h2> <p>در کلاینت خود، دستور رو بر اساس IP و Name خودتون بازنویسی کنید:</p> <pre><code class="bash language-bash">ssh -p 8022 u0_a202@192.168.1.2 </code></pre> <p>وقتی از شما پرسید </p> <p><code>Are you sure you want to continue connecting (yes/no/[fingerprint])?‎</code></p> <p>yes رو تایپ کنید.</p> <p>اگر مراحل را به درستی دنبال کرده اید، باید متصل شوید و تصویر زیر را ببینید.</p> <p><img src="/image/post/post-termux-ssh-setup-guide/terminal-screenshot.jpg" alt="تصویری از محیط ترمینال که در آن ssh زدیم و همه چیز خوب کار می کند" /></p> <h2 id="-2">یادداشت‌های اضافی</h2> <ul> <li>اگر نیاز به توقف <code>sshd</code> دارید از دستور <code>pkill sshd</code> استفاده کنید</li> <li>برای دسترسی به فضای ذخیره سازی خود از دستور <code>termux-setup-storage</code> در Termux استفاده کنید (نیاز به مجوز فایل و رسانه)</li> <li>ویدیوی مفید: <a href="https://www.youtube.com/watch?v=qfARNLChgpE&list=PL-tKrPVkKKE0kM18Sg5fqaZW1V2nidAeU&index=79"> الپیک ۱ - ۰۷۹ - ماجول ۱۱۰.۳ (۱/۳) - امن کردن سیستم از طریق رمزنگاری، مفهوم جفت کلید و کاربرد در ssh</a></li> </ul>',
    author: 'مصطفی نعمت‌پور',
    imageURL: '/image/post/post-termux-ssh-setup-guide/cover.jpg',
    imageAlt: 'متن SSH into android (Termux) Passwordless با رنگ سبز روی زمینه مشکی ماتریکسی',
    blogColor: '#1f2328',
    categories: getCategories([5, 2]),
    createAt: '2024-04-25 10:24',
    updateAt: '2024-04-25 10:24'
  },
  {
    id: 2,
    title: 'استقرار سایت با کمک GitHub Pages و cloudflare',
    slug: 'استقرار-سایت-با-کمک-github-pages-و-cloudflare',
    description:
      'تازه فصل سوم سریال The Mandalorian رو تموم کردم و دنبال اسم برای دامنه سایت بودم. خب اولین اسمی که تو ذهنم اومد grogu بود که اسم اصلی baby yoda بود و در عین ناباوری دامنه رو کسی رزرو نکرده بود :) و این شد شروع خرید و اتصال دامنه به سایت، در این پست توضیحات بیشتری میدم.',
    body: '<p>تازه فصل سوم سریال The Mandalorian رو تموم کردم و دنبال اسم برای دامنه سایت بودم. خب اولین اسمی که تو ذهنم اومد grogu بود که اسم اصلی baby yoda بود و در عین ناباوری دامنه رو کسی رزرو نکرده بود :) و این شد شروع خرید و اتصال دامنه به سایت، در این پست توضیحات بیشتری میدم.</p> <h2 id="groguir">خرید دامنه grogu.ir</h2> <p>برای خرید دامنه باید توی <a href="https://nic.ir">nic.ir</a> اکانت داشته باشید و تایید هویت رو انجام بدین. من برای خرید دامنه از طریق <a href="https://www.iranserver.com/">ایران سرور</a> اقدام کردم و در کمال تعجب در مدت زمان دو تا سه ساعت خرید دامنه انجام شد و حتی می‌شد از خود ایرنیک ns ها رو در لحظه عوض کرد که خیلی برام عجیب بود چون خرید دامنه و ثبت اون توی دفعه‌های قبلی خرید، حداقل یکی دو روز طول می‌کشید.</p> <h2 id="nsdns">ثبت NS ها برای تنظیم DNS سایت</h2> <p>برای هاستیگ سایت از سرویس هاستینگ استاتیک گیت‌هاب استفاده کردم که در ادامه بیشتر توضیح میدم. برای اتصال دامنه به هاست پروژه، گیت‌هاب یه سری IP داده بود (من در این زمینه دانش کافی ندارم) که خب هر کاری کردم نتونستم توی ایرنیک در قسمت <strong>ردیف‌های کارگزار نام (NS)</strong> اضافه کنم، به پشتیبانی ایران سرور پیام دادم و نتیجه این شد که باید از سرویس DNS سایت <a href="https://cloudflare.com/">cloudflare</a> استفاده کنم.</p> <p>بعد از ثبت نام و اضافه کردن دامنه و ردیف‌های DNS همه چیز به درستی کار کرد.</p> <p>توی لینوکس با دستور <code>nslookup</code> میشه درخواست جستجوی DNS داد. به عنوان مثال برای دامنه grogu.ir درخواست میدیم:</p> <pre><code>$ nslookup grogu.ir<br></code></pre> <p>نتیجه میشه:</p> <pre><code>Server:         5.200.200.200<br>Address:        5.200.200.200#53<br><br>Non-authoritative answer:<br>Name:   grogu.ir<br>Address: 185.199.111.153<br>Name:   grogu.ir<br>Address: 185.199.109.153<br>Name:   grogu.ir<br>Address: 185.199.108.153<br>Name:   grogu.ir<br>Address: 185.199.110.153<br>Name:   grogu.ir<br>Address: 2606:50c0:8001::153<br>Name:   grogu.ir<br>Address: 2606:50c0:8000::153<br>Name:   grogu.ir<br>Address: 2606:50c0:8003::153<br>Name:   grogu.ir<br>Address: 2606:50c0:8002::153<br></code></pre> <h2 id="githubpages">GitHub Pages</h2> <p>یکی از سرویس های پرکاربرد و خیلی خوب گیت‌هاب، GitHub Pages هست. برای مشاهده <a href="https://docs.github.com/en/pages">اسناد اون از این لینک</a> استفاده کنید. بطور کلی برای هر repo می‌تونید اون رو فعال کنید و امکان هاستینگ فایل های استاتیک رو در اختیارتون قرار میده. همچین برای استفاده از اون نیازی به دامنه اختصاصی ندارید و آدرسی با فرمت <code>http(s)://&lt;username&gt;.github.io/&lt;repository&gt;‎</code> در اختیارتون قرار میده. برای اتصال اون به دامنه اختصاصی باید IP هایی که توی داکیومنتش هست رو در بخشDNS Records سرویس دهنده DNS تون قرار بدید.</p> <p><img src="/image/cloudflare-dns-screenshot.png" alt="تصویری از رکورد های dns در سایت cloudflare.com" /></p> <h2 id="vuejsvite">تنظیمات اضافی Vuejs و Vite</h2> <h3 id="vite">Vite</h3> <p>یکی از خوبی‌های GitHub Pages رایگان بودنش هست ولی در کنار خوبی‌هایی که داره مشکلاتی هم هست که باید رفع بشه. برای مثال GitHub Pages فقط دو پوشه <code>‎/ (root)</code> یا <code>‎/docs</code> رو برای نمایش محتوا ارائه میده که خب چون سورس اصلی سایت هم روی همین repo هست تنها انتخاب من <code>‎/docs</code> می‌تونست باشه. برای همین توی فایل <code>vite.config.ts</code> تنظیمات مربوط به پوشه خروجی رو تغییر دادم به <code>"‎./docs"</code>:</p> <pre><code>export default defineConfig({<br>  plugins: [<br>    vue(),<br>  ],<br>  resolve: {<br>    alias: {<br>      "@": fileURLToPath(new URL("./src", import.meta.url))<br>    }<br>  },<br>  build: {<br>    outDir: "./docs"<br>  }<br>})<br></code></pre> <h3 id="vuejs">Vuejs</h3> <p>چون من از <code>vue-router</code> استفاده می‌کنم و توانایی تغییر تنظیمات وب‌سرور رو  ندارم تا درخواست‌های صفحات وب رو به <code>index.html</code> منتقل کنم فعلا باید از <code>vue-router</code> در حالت WebHashHistory استفاده کنم که به SEO سایت ضربه می‌زنه. هرچند فعلا هیچ محتوای خاصی نداریم که بخوام دنبال SEO باشم :) رویکرد پیشنهادی در این شرایط استفاده از فریمرک‌های SSG مثل <a href="https://vitepress.dev">VitePress</a> هست، ولی ترجیح من استفاده از خود Vue هست تا در آینده، نگه‌داری وبلاگ راحت‌تر باشه.</p> <h2 id="">سخن آخر</h2> <p>اینکه سایت به مرور در حال تکامل هست خیلی هیجان انگیزه. </p>',
    author: 'مصطفی نعمت‌پور',
    imageURL: '/image/blog-production-post-image.jpg',
    imageAlt: 'متن hello world که روی یک تصویر با زمینه تیره نوشته شده',
    blogColor: '#1f2328',
    categories: getCategories([2, 3, 4]),
    createAt: '2024-02-18 18:14',
    updateAt: '2024-02-18 18:14'
  },
  {
    id: 1,
    title: 'سلام دنیا',
    slug: 'سلام-دنیا',
    description:
      'خیلی وقت بود که دوست داشتم وبلاگ خودم رو داشته باشم. یکی دوبار هم تلاش کردم ولی ادامه ندادم. دوست داشتم جایی جایی داشته باشم تا نظرات خودم رو بنویسم، شاید هم چند تا پست برای آموزش برنامه‌نویسی نوشتم.',
    body: '<p>خیلی وقت بود که دوست داشتم وبلاگ خودم رو داشته باشم. یکی دوبار هم تلاش کردم ولی ادامه ندادم. دوست داشتم جایی داشته باشم تا نظرات خودم رو بنویسم، شاید هم چند تا پست برای آموزش برنامه‌نویسی نوشتم.</p> <p>اما دلیل اصلی که تو این زمان شروع کردم به ساخت وبلاگ اینه که حس می‌کنم دارم بزرگ می‌شم، نه از اون نظر که دانش بسیاری کسب کردم و الان وقتشه که انتشارشون بدم. نه. فکر می‌کنم حافظه‌ام پر شده و هر خاطره جدید که میاد یه خاطره قدیمی رو پاک می‌کنه. انگار ظرفیت‌ش پر شده. شاید مسخره باشه ولی الان حس می‌کنم آدم خنگ‌تری هستم نسبت به چند سال قبل خودم. که البته اصلا منطقی نیست چون اندوخته‌های این چند مدت به علاوه اندوخته‌های قبلی‌ام باید باعث پیشرفت ذهنی بشه نه نقطه‌ای که الان هستم. بیخیال بیاین از اینا عبور کنیم.</p> <p>این پروژه وبلاگ با Vuejs درست شده و بخش زیادی از طرح بصری (همون دیزاین خودمون) از بلاگ گیت‌هاب کپی شده. فعلا هیچ بخش خاصی نداره که بخوام توضیح بدم، پس یکم در مورد تعریف خودم از وبلاگ صحبت می‌کنم.</p> <p>زمانی که من برای اولین بار به اینترنت دسترسی پیدا کردم، سال اول راهنماییم بود (الان شده متوسطه اول). در اون دوران ما با فیلتر شکن‌ها و روش‌های پیچیده‌ای که این روز ها با استفاده ازشون به اینترنت وصل می‌شیم آشنا نبودم. قهرمان اون زمان من موتورهای جستجویی مثل یاهو، گوگل و بینگ بودن که البته گوگل از بقیه بهتر بود. رفته رفته یاد گرفتم که چطور از چیزی که اون زمان بهش می‌گفتیم اینترنت استفاده کنم. سرچ می‌کردیم و توی سایت‌هایی که میاورد جوابم رو پیدا می‌کردیم و یا انقدر خوش شانس بودم که ساعت رولکس چند میلیون تومنی رو سی و نه هزار تومن برنده می‌شدم. تمام درک من هم از شبکه اجتماعی انجمن های فارسی زبانی بود که توشون عضو بودم.</p> <p>شاید بشه اون زمان رو روزهای آخر دوران باشکوه وبلاگ نویسی بیان کرد. و همچنین روزهای شروع جنگ کمپانی‌ها، که کدوم سریع تر گوشی با صفحه نمایش بزرگتر و تعداد هسته سی‌پی‌یو بیشتر به بازار می‌دن.<br>زمانی که دید انتقادی به ماهیت تکنولوژی های جدید هیچ جایگاهی بین ما نداشت.</p> <p>در این لحظه ساخت این بلاگ شاید ایده خوبیه، تا ببینیم چی پیش میاد :)</p> ',
    author: 'مصطفی نعمت‌پور',
    imageURL: '/image/hello-word-image.png',
    imageAlt: 'متن hello world که روی یک تصویر با زمینه تیره نوشته شده',
    blogColor: '#1f2328',
    categories: getCategories([1]),
    createAt: '2024-02-16 10:02',
    updateAt: '2024-02-16 10:02'
  }
]

// Filter the categories based on the array of IDs
function getCategories(arrayOfIds: Number[]): Category[] {
  return categories.filter((item) => arrayOfIds.includes(item.id))
}
export { posts }
